InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиТоваровВРознице</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиТоваровВРознице</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойСчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОказаниеУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректКостинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокСписанияРасходовНаСебестоимостьУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСписанияРасходовНаСебестоимостьУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьПолуфабрикатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСебестоимостиПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСебестоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьУслугСобственнымПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУчетаВыпускаГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаСтоимостиВыпуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоЭлементамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоСтатьямЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьРезервыПоСомнительнымДолгам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантБухгалтерскойОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыБухгалтерскойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддержкаПБУ18</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПлановуюСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаОтложенногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаОтложенногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыОбслуживающихПроизводствВключатьВПрочиеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияАвансовВыданных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОтраженияАвансовВыданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыУчетаСтоимостиВыпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыУчетаСтоимостиВыпуска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтклоненияСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическаяСтоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСтоимость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
					<Comment>ОСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
					<Comment>НПД</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗарплаты</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезерваОтпусков</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияИИзносОС</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеВНУЛизинговыхПлатежей</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияНМАИсписаниеРасходовПоНИОКР</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВалютныхСредств</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСтоимостиНоменклатуры</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета97</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговойНаценкиПоПроданнымТоварам</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаИмущество</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТранспортногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗемельногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговогоСбора</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеОСДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДопРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТаможенныхПлатежейДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетДолейСписанияКосвенныхРасходов</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов20_23_25_26</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета44</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПоСомнительнымДолгам</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеАвансовВПрочиеДоходыДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляУСН</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСтраховыхВзносовИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРасходовУменьшающихОтдельныеНалоги</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов90_91</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеУбытковПрошлыхЛет</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОтложенногоНалога</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЕНВД</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНДФЛДляИП</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеформацияБаланса</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсобыеПравилаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокСтатейЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПрямыхЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись           - РегистрСведенийЗапись - запись регистра
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		НачалоГода(ТекущаяДатаСеанса()));
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Организация",
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	
	// Розница
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СпособОценкиТоваровВРознице",
		Перечисления.СпособыОценкиТоваровВРознице.ПоСтоимостиПриобретения);
		
	// Производство
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ОсновнойСчетУчетаЗатрат",
		ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ВыпускПродукции",
		Ложь);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись, 
		ДанныеЗаполнения, 
		"ОказаниеУслуг",
		Ложь);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"РассчитыватьСебестоимостьПолуфабрикатов",
		Ложь);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"РассчитыватьСебестоимостьУслугСобственнымПодразделениям",
		Ложь);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СпособОтраженияАвансовВыданных",
		Перечисления.СпособОтраженияАвансовВыданных.ДебиторскаяЗадолженность);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ИспользоватьПлановуюСебестоимость",
		Ложь);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ДиректКостинг",
		Истина);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ПорядокСписанияРасходовНаСебестоимостьУслуг",
		Перечисления.ПорядокСписанияРасходовНаСебестоимостьУслуг.БезУчетаВыручки);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ВариантБухгалтерскойОтчетности",
		ВариантБухгалтерскойОтчетностиПоУмолчанию());
	
	// Производство: Выпуск продукции, услуг
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СпособУчетаВыпускаГотовойПродукции",
		Перечисления.ВариантыУчетаСтоимостиВыпуска.ФактическаяСтоимость);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СпособРасчетаСебестоимостиПроизводства",
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам);
		
	// При отключенной опции ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств в учетной политике
	// банковские документы не формируют движений - ожидается, что движения по банку и кассе сформируют кассовые документы.
	// При включенной интеграции с банками остатки по банку должны всегда совпадать с выпиской - поэтому опцию нужно включить.
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств",
		ИнтеграцияСБанкамиПовтИсп.ИнтеграцияВИнформационнойБазеВключена());
		
	// Запасы
	Если (УчетнаяПолитика.СистемаНалогообложения(Запись.Организация, Запись.Период) = Перечисления.СистемыНалогообложения.Упрощенная
			И УчетнаяПолитика.ОбъектНалогообложенияУСН(Запись.Организация, Запись.Период) = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы)
		ИЛИ (НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Запись.Организация) И УчетнаяПолитика.СистемаНалогообложения(Запись.Организация, Запись.Период) = Перечисления.СистемыНалогообложения.Общая) Тогда
		
		НастройкиУчета.УстановитьЗначениеПоУмолчанию(
			Запись,
			ДанныеЗаполнения,
			"СпособОценкиМПЗ",
			Перечисления.СпособыОценки.ФИФО);
		
	Иначе
		НастройкиУчета.УстановитьЗначениеПоУмолчанию(
			Запись,
			ДанныеЗаполнения,
			"СпособОценкиМПЗ",
			Перечисления.СпособыОценки.ПоСредней);
	КонецЕсли;
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ВариантУчетаОтложенногоНалога",
		Перечисления.ВариантыУчетаОтложенногоНалога.Нет);
		
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СпособОтраженияАвансовВыданных",
		Перечисления.СпособОтраженияАвансовВыданных.ДебиторскаяЗадолженность);
		
КонецПроцедуры

// Возвращает сведения о варианте бухгалтерской отчетности
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, для которой необходимо получить данные.
//   Период      - Дата - период, на который необходимо получить данные.
// 
// Возвращаемые значения:
//  Неопределено                                       - когда нет записей в регистре
//  ПеречислениеСсылка.ВариантыБухгалтерскойОтчетности - значение ресурса ВариантБухгалтерскойОтчетности
//
Функция ВариантБухгалтерскойОтчетностиДействующейУчетнойПолитики(Организация, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетнаяПолитикаСрезПоследних.ВариантБухгалтерскойОтчетности
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВариантБухгалтерскойОтчетности = Выборка.ВариантБухгалтерскойОтчетности;
	Иначе
		ВариантБухгалтерскойОтчетности = Неопределено;
	КонецЕсли;
	
	Возврат ВариантБухгалтерскойОтчетности;
	
КонецФункции

Функция ДоступноВключениеПлановойСебестоимости(Организация, Период) Экспорт
	
	РезультатЗапросаДокументыБезПлановойСебестоимости = РезультатЗапросаДокументыБезПлановойСебестоимости(Организация, Период, Истина);
	
	Возврат РезультатЗапросаДокументыБезПлановойСебестоимости.Пустой();
	
КонецФункции

// Процедура формирует список документов, препятствующих включению плановой себестоимости.
// Предназначена для запуска в фоновом режиме.
//
// Параметры:
//  Параметры		 - Структура - см. параметр ПараметрыПроцедуры в ДлительныеОперации.ВыполнитьВФоне()
//  					Обязательно должны быть свойства:
//						- Организация - Организация, по которой выполняется проверка.
//						- Период - период записи учетной политики, для которой выполняется проверка. 
//  АдресХранилища	 - Строка - адрес временного хранилища, в которое должен быть помещен результат работы процедуры. 
//
Процедура СформироватьСписокДокументовПрепятствующихВключениюПлановойСебестоимости(Параметры, АдресХранилища) Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Результат", Новый ТабличныйДокумент);
		
	РезультатЗапросаДокументыБезПлановойСебестоимости = РезультатЗапросаДокументыБезПлановойСебестоимости(
		Параметры.Организация,
		Параметры.Период);
			
	Выборка = РезультатЗапросаДокументыБезПлановойСебестоимости.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		ПарамерыШапки = Новый Структура;
		
		ПарамерыШапки.Вставить("Заголовок", НСтр("ru = 'Документы выпуска без плановых цен'"));
		
		Обработки.ФункциональностьПрограммы.ЗаполнитьТабличныйДокументПоДаннымВыборки(
			СтруктураРезультата.Результат,
			"Строка",
			Выборка,
			,
			"Шапка",
			ПарамерыШапки);
		
	КонецЕсли;
			
	ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресХранилища);
	
КонецПроцедуры

// Исправляет (устраняет) в наборе записей учетной политики значения свойств, недоступные (запрещенные)
// исходя из настроек функциональности.
//
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей.УчетнаяПолитика
//
Процедура ИсправитьНедоступныеЗначенияСвойств(НаборЗаписей) Экспорт
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		НедоступныеЗначения = НедоступныеЗначенияСвойств(Запись);
		
		Для Каждого ОписаниеРесурса Из НедоступныеЗначения Цикл
			
			// Не используется ЗаполнитьЗначенияСвойств, чтобы предотвратить модификацию фактически неизменного набора
			
			Если Запись[ОписаниеРесурса.Ключ] = ОписаниеРесурса.Значение Тогда
				Продолжить;
			КонецЕсли;
			
			Запись[ОписаниеРесурса.Ключ] = ОписаниеРесурса.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет год перехода на ФСБУ 5.
// Предполагается, что организация применяет новый стандарт с даты обязательного применения (за 2021 год)
// или начиная с года, следующего за годом опубликования (за 2020 год).
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  УчитыватьДосрочноеПрименение - учитываются настройки программы, позволяющие предположить, что стандарт применяется досрочно.
//            Имеет смысл учитывать эти настройки, если речь идет о подготовке отчетности, но не о ежемесячных операциях.
// 
// Возвращаемое значение:
//  Дата         - начало года перехода на ФСБУ 5
//  Неопределено - ФСБУ 5 применяется с даты основания организации
//
Функция ГодПервогоПримененияФСБУ5(Знач Организация, УчитыватьДосрочноеПрименение = Истина) Экспорт
	
	ОбязательноеПрименениеФСБУ5 = БухгалтерскийУчетКлиентСервер.ДатаОбязательногоПримененияФСБУ5();
	
	Организация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация);
	
	ОбязательныйПериод = БухгалтерскийУчет.БлижайшийОтчетныйПериод(ОбязательноеПрименениеФСБУ5, Организация);
	Если ОбязательныйПериод.Период > ОбязательноеПрименениеФСБУ5 Тогда
		// Вопрос перехода на ФСБУ 5 для организации не актуален
		Возврат Неопределено;
	КонецЕсли;
	
	ДосрочноеПрименение = Ложь;
	Если УчитыватьДосрочноеПрименение Тогда
		// В программе автоматизирован учет обесценения только по ФСБУ 5.
		// При этом, учет обесценения - это единственная настройка, указывающая на применение ФСБУ 5.
		// Если эта автоматизация используется до даты обязательного применения ФСБУ 5,
		// то стандарт применяется досрочно.
		ДосрочноеПрименение = УчетнаяПолитика.ОбесценениеЗапасов(Организация, ОбязательноеПрименениеФСБУ5 - 1);
	КонецЕсли;
	
	Если ДосрочноеПрименение Тогда
		Год = 12; // Месяцев
		Возврат ДобавитьМесяц(ОбязательноеПрименениеФСБУ5, -Год);
	Иначе
		Возврат ОбязательноеПрименениеФСБУ5;
	КонецЕсли;
	
КонецФункции

// Определяет, может ли организация продолжить применять в указанном периоде
// устаревший ПБУ 5 "Учет материально-производственных запасов"
// (или должна перейти на ФСБУ 5 "Запасы")
//
// Параметры:
//  Период      - Дата
//  Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//  Булево - Истина, если может применять ПБУ 5; Ложь, если обязана применять ФСБУ 5
//
Функция ПрименяетсяПБУ5(Период, Организация) Экспорт
	
	Если Период >= БухгалтерскийУчетКлиентСервер.ДатаОбязательногоПримененияФСБУ5() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГодПервогоПрименения = ГодПервогоПримененияФСБУ5(Организация, Ложь);
	Если ГодПервогоПрименения = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Период < ГодПервогоПрименения;
	
КонецФункции

// Копирует запись учетной политики в новый период
//
// Параметры:
//  Источник    - РегистрСведенийКлючЗаписи.УчетнаяПолитика - копируемые данные
//                Допускается передавать коллекцию с одноименными свойствами.
//  ПериодКопии - Дата - новый период
//
Процедура СкопироватьЗапись(Источник, ПериодКопии) Экспорт
	
	МенеджерЧтения = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЧтения, Источник);
	МенеджерЧтения.Прочитать();
	
	Если Не МенеджерЧтения.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, МенеджерЧтения);
	
	НастройкиУчетаЗатрат = Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат();
	Справочники.НастройкиУчетаЗатрат.ПрочитатьСсылку(НастройкиУчетаЗатрат, МенеджерЧтения.НастройкиУчетаЗатрат);
	
	МенеджерЗаписи.Период = ПериодКопии;
	Записать(МенеджерЗаписи, НастройкиУчетаЗатрат);
	
КонецПроцедуры

// Записывает все данные учетной политики, включая хранимые в связанных объектах.
//
// Параметры:
//  МенеджерЗаписи       - РегистрСведенийМенеджерЗаписи.УчетнаяПолитика - записываемая учетная политика
//  НастройкиУчетаЗатрат - Структура - см. Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат
//                             сохраняемые настройки учета затрат
//                       - Неопределено - настройки не указаны (в частности, не изменялись пользователем)
//  ЭтоФормаЗаписи       - Булево - Истина, если запись выполняется интерактивно из формы записи учетной политики
//
Процедура Записать(МенеджерЗаписи, НастройкиУчетаЗатрат = Неопределено, ЭтоФормаЗаписи = Ложь) Экспорт
	
	// Сейчас пользователь не взаимодействует явно с записями настроек учета затрат.
	// Фактически они выполняют служебную роль контейнера связанных сведений учетной политики:
	// каждой записи учетной политики соответствует отдельная запись справочника.
	// Предполагается, что в будущих версиях настройки могут стать явными.
	
	Если ЗначениеЗаполнено(МенеджерЗаписи.НастройкиУчетаЗатрат) Тогда
		Если МенеджерЗаписи.Выбран() Тогда
			ЗаписьНастройки = МенеджерЗаписи.НастройкиУчетаЗатрат.ПолучитьОбъект();
		ИначеЕсли НастройкиУчетаЗатрат = Неопределено Тогда
			НастройкиУчетаЗатрат = Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат();
			Справочники.НастройкиУчетаЗатрат.ПрочитатьСсылку(НастройкиУчетаЗатрат, МенеджерЗаписи.НастройкиУчетаЗатрат);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаписьНастройки = Неопределено Тогда
		
		МенеджерЗаписи.НастройкиУчетаЗатрат = Справочники.НастройкиУчетаЗатрат.ПолучитьСсылку();
		
		ЗаписьНастройки = Справочники.НастройкиУчетаЗатрат.СоздатьЭлемент();
		ЗаписьНастройки.Заполнить(Неопределено);
		ЗаписьНастройки.УстановитьСсылкуНового(МенеджерЗаписи.НастройкиУчетаЗатрат);
		
	КонецЕсли;
	
	Если НастройкиУчетаЗатрат <> Неопределено Тогда
		ЗаписьНастройки.Заполнить(НастройкиУчетаЗатрат);
	КонецЕсли;
	
	ЗаписьНастройки.УстановитьНаименованиеПоКонтексту(МенеджерЗаписи);
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ЗаписьНастройки.Модифицированность() Тогда
			ЗаписьНастройки.Записать();
		КонецЕсли;
		
		МенеджерЗаписи.Записать(Не ЭтоФормаЗаписи);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация.ГоловнаяОрганизация
	|;
	|РазрешитьЧтение
	|ГДЕ
	| ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	| ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	ПараметрыЗаполнения = ПараметрыЗаполненияШапкиПечатнойФормы(ПараметрыПечати.ИмяМакета, ПараметрыПечати);
	Если ПараметрыПечати.ИмяМакета = "ПланСчетов" Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПланСчетов",
			ПараметрыЗаполнения.ЗаголовокШапки,
			ТабличныйДокументПланСчетов(ПараметрыЗаполнения));
	ИначеЕсли ПараметрыПечати.ИмяМакета = "РегистрыБУ"
		ИЛИ ПараметрыПечати.ИмяМакета = "РегистрыНУ" 
		ИЛИ ПараметрыПечати.ИмяМакета = "ПервичныеДокументы" Тогда
		
		Если ПараметрыПечати.ИмяМакета = "РегистрыБУ" Тогда
			ТаблицаФорм = ТаблицаФормДокументовИлиРегистров(
				"РегистрыБУ", "РегистрыБУСлужебный", ПараметрыПечати, ПараметрыЗаполнения);
		ИначеЕсли ПараметрыПечати.ИмяМакета = "РегистрыНУ" Тогда
			ТаблицаФорм = ТаблицаФормДокументовИлиРегистров(
				"РегистрыНУ", "РегистрыНУСлужебный", ПараметрыПечати, ПараметрыЗаполнения);
		ИначеЕсли ПараметрыПечати.ИмяМакета = "ПервичныеДокументы" Тогда
			ТаблицаФорм = ТаблицаФормДокументовИлиРегистров(
				"ПервичныеДокументы", "ПервичныеДокументыСлужебный", ПараметрыПечати, ПараметрыЗаполнения);
		КонецЕсли;
		КоллекцияПечатныхФорм.Очистить();
		Для каждого СтрокаТаблицы Из ТаблицаФорм Цикл
			НоваяСтрока = КоллекцияПечатныхФорм.Добавить();
			НоваяСтрока.ИмяМакета = СтрокаТаблицы.Идентификатор;
			НоваяСтрока.СинонимМакета = СтрокаТаблицы.Наименование;
			НоваяСтрока.ТабличныйДокумент = СтрокаТаблицы.ТабличныйДокумент;
			НоваяСтрока.Экземпляров = 1;
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеПечатнойФормыУчетнойПолитики(ИмяМакета, Запись) Экспорт
	
	ДанныеПечатнойФормы = Новый Структура("Документ,ЗаголовокФормы");
	ДанныеПечатнойФормы.Документ = Новый ТабличныйДокумент;
	ПараметрыЗаполнения = ПараметрыЗаполненияШапкиПечатнойФормы(ИмяМакета, Запись);
	ДанныеПечатнойФормы.ЗаголовокФормы = ПараметрыЗаполнения.ЗаголовокФормы;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Если ИмяМакета = "УчетнаяПолитикаБУ" 
		ИЛИ ИмяМакета = "УчетнаяПолитикаНУ" Тогда
		ТабличныйДокумент = ТабличныйДокументУчетнойПолитикиБУ_НУ(ИмяМакета, Запись, ПараметрыЗаполнения);
	ИначеЕсли ИмяМакета = "Приказ" Тогда
		ТабличныйДокумент = ТабличныйДокументПриказ(Запись, ПараметрыЗаполнения);
	КонецЕсли;
	
	ДанныеПечатнойФормы.Документ = ФорматированныйДокументИзТабличного(ТабличныйДокумент);
	
	Возврат ДанныеПечатнойФормы;
	
КонецФункции

Функция ТабличныйДокументУчетнойПолитикиБУ_НУ(ИмяМакета, Запись, ПараметрыЗаполнения)
	
	Результат = Новый ТабличныйДокумент;
	
	МакетОформления = РегистрыСведений.УчетнаяПолитика.ПолучитьМакет("МакетОформления");
	МакетСодержания = РегистрыСведений.УчетнаяПолитика.ПолучитьМакет(ИмяМакета);
	
	ОбластьШапка   = МакетОформления.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ПараметрыЗаполнения);
	Результат.Вывести(ОбластьШапка);
	
	ПараметрыСодержания = ПараметрыЗаполненияСодержанияПечатнойФормы(Запись);
	ОбластьСодержания   = МакетСодержания.ПолучитьОбласть("Содержание");
	ОбластьСодержания.Параметры.Заполнить(ПараметрыСодержания);
	ДокументСодержания = Новый ТабличныйДокумент;
	ДокументСодержания.Вывести(ОбластьСодержания);
	
	ПараметрыОпций = Новый Структура("Организация,Период", Запись.Организация, НачалоМесяца(Запись.Период));
	
	ЗначенияОпций  = Новый Соответствие;
	УстановитьДополнительныеЗначенияОпций(ЗначенияОпций, Запись);
	
	ВыводитьЗаголовок1  = Истина;
	ВыводитьЗаголовок2  = Истина;
	ВыводитьРазделитель = Ложь;
	НомерЗаголовка2     = 1;
	
	Для НомерСтроки = 1 По ДокументСодержания.ВысотаТаблицы Цикл
		
		ТекстЗаголовка1 = ДокументСодержания.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		Если НЕ ПустаяСтрока(ТекстЗаголовка1) Тогда
			ВыводитьЗаголовок1 = ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций);
			Если ВыводитьЗаголовок1 Тогда
				Если ВыводитьРазделитель Тогда
					ВывестиРазделитель(Результат, МакетОформления);
					ВыводитьРазделитель = Ложь;
				КонецЕсли;
				ВывестиЗаголовок1(Результат, ТекстЗаголовка1, МакетОформления);
				ВыводитьЗаголовок2 = Истина;
				НомерЗаголовка2    = 1;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыводитьЗаголовок1 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗаголовка2 = ДокументСодержания.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
		Если НЕ ПустаяСтрока(ТекстЗаголовка2) Тогда
			ВыводитьЗаголовок2 = ?(НЕ ПустаяСтрока(ТекстЗаголовка1),
				Истина,
				ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций));
			Если ВыводитьЗаголовок2 Тогда
				Если ВыводитьРазделитель Тогда
					ВывестиРазделитель(Результат, МакетОформления);
					ВыводитьРазделитель = Ложь;
				КонецЕсли;
				ВывестиЗаголовок2(Результат, ТекстЗаголовка2, НомерЗаголовка2, МакетОформления);
				НомерЗаголовка2 = НомерЗаголовка2 + 1;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыводитьЗаголовок2 Тогда
			Продолжить;
		КонецЕсли;
		
		Текст = ДокументСодержания.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
		Если НЕ ПустаяСтрока(Текст) Тогда
			ВыводитьТекст = ?(НЕ ПустаяСтрока(ТекстЗаголовка1) ИЛИ НЕ ПустаяСтрока(ТекстЗаголовка2),
				Истина,
				ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций));
			Если ВыводитьТекст Тогда
				ВывестиТекст(Результат, Текст, МакетОформления);
				ВыводитьРазделитель = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТабличныйДокументПриказ(Запись, ПараметрыЗаполнения)
	
	Результат = Новый ТабличныйДокумент;
	
	МакетСодержания   = РегистрыСведений.УчетнаяПолитика.ПолучитьМакет("Приказ");
	ОбластьСодержания = МакетСодержания.ПолучитьОбласть("Содержание");
	ОбластьСодержания.Параметры.Заполнить(ПараметрыЗаполнения);
	Результат.Вывести(ОбластьСодержания);
	
	Возврат Результат;
	
КонецФункции

Функция ТабличныйДокументПланСчетов(ПараметрыЗаполнения)

	Результат = ПланыСчетов.Хозрасчетный.ПечатьПланаСчетов(Ложь, ПараметрыЗаполнения);
	
	Возврат Результат;

КонецФункции

Функция ТаблицаФормДокументовИлиРегистров(ИмяМакетаФорм, ИмяМакетаСписка, Запись, ПараметрыЗаполнения)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Наименование",  Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Ландшафт",      Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ТабличныйДокумент");
	
	// 1. Перечень всех форм используемых документов или регистров
	
	ПереченьФорм = Новый ТабличныйДокумент;
	
	МакетОформления = РегистрыСведений.УчетнаяПолитика.ПолучитьМакет("МакетОформления");
	МакетСодержания = РегистрыСведений.УчетнаяПолитика.ПолучитьМакет(ИмяМакетаСписка);
	
	ОбластьШапка   = МакетОформления.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ПараметрыЗаполнения);
	ПереченьФорм.Вывести(ОбластьШапка);
	
	ДокументСодержания = МакетСодержания.ПолучитьОбласть("Содержание");
	
	ПараметрыОпций = Новый Структура("Организация,Период", Запись.Организация, НачалоМесяца(Запись.Период));
	ЗначенияОпций  = Новый Соответствие;
	УстановитьДополнительныеЗначенияОпций(ЗначенияОпций, Запись);
	
	ВыводитьЗаголовок1  = Истина;
	ВыводитьЗаголовок2  = Истина;
	ВыводитьРазделитель = Ложь;
	НомерЗаголовка2     = 1;
	
	Для НомерСтроки = 1 По ДокументСодержания.ВысотаТаблицы Цикл
		
		ТекстЗаголовка1 = ДокументСодержания.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		Если НЕ ПустаяСтрока(ТекстЗаголовка1) Тогда
			ВыводитьЗаголовок1 = ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций);
			Если ВыводитьЗаголовок1 Тогда
				Если ВыводитьРазделитель Тогда
					ВывестиРазделитель(ПереченьФорм, МакетОформления);
					ВыводитьРазделитель = Ложь;
				КонецЕсли;
				ВывестиЗаголовок1(ПереченьФорм, ТекстЗаголовка1, МакетОформления);
				НомерЗаголовка2 = 1;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыводитьЗаголовок1 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗаголовка2 = ДокументСодержания.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
		Если НЕ ПустаяСтрока(ТекстЗаголовка2) Тогда
			ВыводитьЗаголовок2 = ?(НЕ ПустаяСтрока(ТекстЗаголовка1),
				Истина,
				ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций));
			Если ВыводитьЗаголовок2 Тогда
				Если ВыводитьРазделитель Тогда
					ВывестиРазделитель(ПереченьФорм, МакетОформления);
					ВыводитьРазделитель = Ложь;
				КонецЕсли;
				ВывестиЗаголовок2(ПереченьФорм, ТекстЗаголовка2, НомерЗаголовка2, МакетОформления);
				НомерЗаголовка2 = НомерЗаголовка2 + 1;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыводитьЗаголовок2 Тогда
			Продолжить;
		КонецЕсли;
		
		Текст = ДокументСодержания.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
		Если НЕ ПустаяСтрока(Текст) Тогда
			ВыводитьТекст = ?(НЕ ПустаяСтрока(ТекстЗаголовка1) ИЛИ НЕ ПустаяСтрока(ТекстЗаголовка2),
				Истина,
				ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций));
			Если ВыводитьТекст Тогда
				ВывестиТекст(ПереченьФорм, Текст, МакетОформления);
				ВыводитьРазделитель = Истина;
				Идентификатор = ДокументСодержания.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
				Если ЗначениеЗаполнено(Идентификатор) Тогда
					НоваяСтрока = Результат.Добавить();
					НоваяСтрока.Наименование  = Текст;
					НоваяСтрока.Идентификатор = Идентификатор;
					НоваяСтрока.Ландшафт      = ДокументСодержания.Область(НомерСтроки, 7, НомерСтроки, 7).Текст = "1";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// 2. Шаблоны всех форм используемых документов или регистров, каждый в отдельном табличном документе
	
	МакетФорм = РегистрыСведений.УчетнаяПолитика.ПолучитьМакет(ИмяМакетаФорм);
	Для каждого СтрокаТаблицы Из Результат Цикл
	
		ФормаДокументаРегистра = Новый ТабличныйДокумент;
		ОбластьДокументаРегистра = МакетФорм.ПолучитьОбласть(СтрокаТаблицы.Идентификатор);
		ФормаДокументаРегистра.Вывести(ОбластьДокументаРегистра);
		ФормаДокументаРегистра.ОриентацияСтраницы = ?(СтрокаТаблицы.Ландшафт, 
			ОриентацияСтраницы.Ландшафт, 
			ОриентацияСтраницы.Портрет);
		ФормаДокументаРегистра.АвтоМасштаб        = Истина;
		СтрокаТаблицы.ТабличныйДокумент  = ФормаДокументаРегистра;
	
	КонецЦикла;
	
	НоваяСтрока = Результат.Вставить(0);
	НоваяСтрока.Наименование      = ПараметрыЗаполнения.ЗаголовокПеречня;
	НоваяСтрока.Идентификатор     = "ПереченьФорм";
	НоваяСтрока.Ландшафт          = Ложь;
	НоваяСтрока.ТабличныйДокумент = ПереченьФорм;
	
	Возврат Результат;
	
КонецФункции

Функция ФорматированныйДокументИзТабличного(ТабличныйДокумент)

	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		СтрокаТаблицы = ТабличныйДокумент.ПолучитьОбласть(НомерСтроки, , НомерСтроки);
		НовыйПараграф = ФорматированныйДокумент.Элементы.Добавить();
		НовыйПараграф.ГоризонтальноеПоложение = СтрокаТаблицы.Область(1, 1, 1, 1).ГоризонтальноеПоложение;
		Для НомерКолонки = 1 По СтрокаТаблицы.ШиринаТаблицы Цикл
			ОбластьЯчейки = СтрокаТаблицы.Область(1, НомерКолонки, 1, НомерКолонки);
			Если НЕ ПустаяСтрока(ОбластьЯчейки.Текст) Тогда
				НовыйЭлемент = НовыйПараграф.Элементы.Добавить(
					?(НовыйПараграф.Элементы.Количество() = 0, "", " ") + ОбластьЯчейки.Текст, 
					Тип("ТекстФорматированногоДокумента"));
				НовыйЭлемент.Шрифт      = ОбластьЯчейки.Шрифт;
				НовыйЭлемент.ЦветТекста = ОбластьЯчейки.ЦветТекста;
				НовыйЭлемент.ЦветФона   = ОбластьЯчейки.ЦветФона;
			КонецЕсли;
		КонецЦикла;
		Если НовыйПараграф.Элементы.Количество() = 0 Тогда
			НовыйПараграф.Элементы.Добавить("", Тип("ПереводСтрокиФорматированногоДокумента"));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФорматированныйДокумент;

КонецФункции

Функция ПараметрыЗаполненияСодержанияПечатнойФормы(Запись)

	Результат = Новый Структура;
	
	// Налог на прибыль
	Результат.Вставить("СпособОценкиМПЗ", УчетнаяПолитика.СпособОценкиМПЗ(Запись.Организация, Запись.Период));
	
	// ФСБУ 5
	Результат.Вставить("ГодПервогоПримененияФСБУ5", Формат(ГодПервогоПримененияФСБУ5(Запись.Организация), "ДФ=yyyy"));
	
	НастройкиУчетаЗатрат = УчетнаяПолитика.НастройкиУчетаЗатрат(Запись.Организация, Запись.Период);
	
	Если НастройкиУчетаЗатрат.БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.Выручка Тогда
		Результат.Вставить("БазаРаспределенияКосвенныхЗатрат", НСтр("ru = 'выручке'"));
	ИначеЕсли НастройкиУчетаЗатрат.БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.МатериальныеЗатраты Тогда
		Результат.Вставить("БазаРаспределенияКосвенныхЗатрат", НСтр("ru = 'величине прямых материальных затрат'"));
	ИначеЕсли НастройкиУчетаЗатрат.БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ОбъемВыпуска Тогда
		Результат.Вставить("БазаРаспределенияКосвенныхЗатрат", НСтр("ru = 'объему выпуска в натуральном выражении'"));
	ИначеЕсли НастройкиУчетаЗатрат.БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ОплатаТруда Тогда
		Результат.Вставить("БазаРаспределенияКосвенныхЗатрат", НСтр("ru = 'величине прямых затрат на оплату труда'"));
	ИначеЕсли НастройкиУчетаЗатрат.БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ПлановаяСебестоимость Тогда
		Результат.Вставить("БазаРаспределенияКосвенныхЗатрат", НСтр("ru = 'величине плановых (нормативных) затрат'"));
	Иначе
		Результат.Вставить("БазаРаспределенияКосвенныхЗатрат", НСтр("ru = 'величине прямых затрат'"));
	КонецЕсли;
	
	Результат.Вставить("МетодНачисленияАмортизацииНУ", 
		УчетнаяПолитика.МетодНачисленияАмортизацииНУ(Запись.Организация, Запись.Период));
	Результат.Вставить("ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств", 
		УчетнаяПолитика.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств(Запись.Организация, Запись.Период));
		
	// Резервы отпусков
	НастройкиРезервовОтпусков = УчетЗарплаты.НастройкиРезервовОтпусков(Запись.Организация, Запись.Период);
	Результат.Вставить("НормативОтчисленийВРезервОтпусков", 
		НастройкиРезервовОтпусков.НормативОтчисленийВРезервОтпусков);
	Результат.Вставить("ПредельнаяВеличинаОтчисленийВРезервОтпусков", 
		НастройкиРезервовОтпусков.ПредельнаяВеличинаОтчисленийВРезервОтпусков);
		
	Возврат Результат;

КонецФункции

Процедура УстановитьДополнительныеЗначенияОпций(ЗначенияОпций, Запись)

	// Опции макета УчетнаяПолитикаБУ для формирования текста учетной политики
	
	ВедетсяУчетЗапасов = ПолучитьФункциональнуюОпцию("ИспользоватьДокументыПоступления");
	ЗначенияОпций.Вставить("ВедетсяУчетЗапасов",                 ВедетсяУчетЗапасов);
	ЗначенияОпций.Вставить("ОценкаЗапасовСредняя",               Ложь);
	ЗначенияОпций.Вставить("ОценкаЗапасовФИФО",                  Ложь);
	ЗначенияОпций.Вставить("ОценкаПоПродажнойСтоимости",         Ложь);
	ЗначенияОпций.Вставить("ОбесценениеЗапасов",                 Ложь);
	ЗначенияОпций.Вставить("ПростойУчетПроизводства",            Ложь);
	ЗначенияОпций.Вставить("СложныйУчетПроизводства",            Ложь);
	ЗначенияОпций.Вставить("ПрименяетсяФСБУ5",                   Ложь);
	ЗначенияОпций.Вставить("ПрименяетсяПБУ5",                    Ложь);
	ЗначенияОпций.Вставить("ПервоеПрименениеФСБУ5",              Ложь);
	ЗначенияОпций.Вставить("ОценкаПродукцииПоПлановойСтоимости", Ложь);
	
	Если ВедетсяУчетЗапасов Тогда
		
		СпособОценки = УчетнаяПолитика.СпособОценкиМПЗ(Запись.Организация, Запись.Период);
		ЗначенияОпций["ОценкаЗапасовФИФО"]    = (СпособОценки = Перечисления.СпособыОценки.ФИФО);
		ЗначенияОпций["ОценкаЗапасовСредняя"] = Не ЗначенияОпций["ОценкаЗапасовФИФО"];
		
		СпособОценкиТоваровВРознице = УчетнаяПолитика.СпособОценкиТоваровВРознице(Запись.Организация, Запись.Период);
		ЗначенияОпций["ОценкаПоПродажнойСтоимости"] =
			(СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
		
		ЗначенияОпций["ОбесценениеЗапасов"] = УчетнаяПолитика.ОбесценениеЗапасов(Запись.Организация, Запись.Период);
		
		ГодПервогоПримененияФСБУ5 = ГодПервогоПримененияФСБУ5(Запись.Организация);
		ЗначенияОпций["ПервоеПрименениеФСБУ5"] = (ГодПервогоПримененияФСБУ5 = Запись.Период);
		ЗначенияОпций["ПрименяетсяФСБУ5"]      = (Запись.Период >= ГодПервогоПримененияФСБУ5);
		ЗначенияОпций["ПрименяетсяПБУ5"]       = Не ЗначенияОпций["ПрименяетсяФСБУ5"];
		
		УчетЗатратНаПроизводство = (УчетнаяПолитика.ВыпускПродукции(Запись.Организация, Запись.Период)
			Или УчетнаяПолитика.ОказаниеУслуг(Запись.Организация, Запись.Период));
		Если УчетЗатратНаПроизводство Тогда
			
			ЗначенияОпций["ПростойУчетПроизводства"] = Не ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность");
			ЗначенияОпций["СложныйУчетПроизводства"] = Не ЗначенияОпций["ПростойУчетПроизводства"];
			
			ВариантУчетаСтоимостиВыпуска = УчетнаяПолитика.ВариантУчетаСтоимостиВыпуска(Запись.Организация, Запись.Период);
			ЗначенияОпций["ОценкаПродукцииПоПлановойСтоимости"] =
				(УчетнаяПолитика.ПлановаяСебестоимость(Запись.Организация, Запись.Период)
				И ВариантУчетаСтоимостиВыпуска = Перечисления.ВариантыУчетаСтоимостиВыпуска.ПлановаяСтоимость);
			
		КонецЕсли;
			
	КонецЕсли;
	
	СпособПогашенияСтоимостиСпецодеждыНУ = УчетнаяПолитика.СпособПогашенияСтоимостиСпецодеждыНУ(
		Запись.Организация, Запись.Период);
	ЗначенияОпций.Вставить("ПогашениеСтоимостиСпецодеждыНУАналогичноБУ",
		СпособПогашенияСтоимостиСпецодеждыНУ = Перечисления.СпособыПогашенияСтоимостиНУ.АналогичноСпособуПринятомуДляБухгалтерскогоУчета);
	
КонецПроцедуры

Функция ВыводитьТекущийУровень(ДокументСодержания, НомерСтроки, ЗначенияОпций, ПараметрыОпций)
	
	СтрокаОпцийИстина = ДокументСодержания.Область(НомерСтроки, 4, НомерСтроки, 4).Текст;
	ОпцииИстина       = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаОпцийИстина);
	СтрокаОпцийЛожь   = ДокументСодержания.Область(НомерСтроки, 5, НомерСтроки, 5).Текст;
	ОпцииЛожь         = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаОпцийЛожь);
	
	Для каждого ИмяОпции Из ОпцииИстина Цикл
		ЗначениеОпции = ЗначенияОпций[ИмяОпции];
		Если ЗначениеОпции = Неопределено Тогда
			Если Метаданные.ФункциональныеОпции.Найти(ИмяОпции) = Неопределено Тогда
				ВызватьИсключение ("Нет функциональной опции " + ИмяОпции);
			КонецЕсли;
			ЗначениеОпции = ПолучитьФункциональнуюОпцию(ИмяОпции, ПараметрыОпций);
			ЗначенияОпций.Вставить(ИмяОпции, ЗначениеОпции);
		КонецЕсли;
		Если НЕ ЗначениеОпции Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяОпции Из ОпцииЛожь Цикл
		ЗначениеОпции = ЗначенияОпций[ИмяОпции];
		Если ЗначениеОпции = Неопределено Тогда
			Если Метаданные.ФункциональныеОпции.Найти(ИмяОпции) = Неопределено Тогда
				ВызватьИсключение ("Нет функциональной опции " + ИмяОпции);
			КонецЕсли;
			ЗначениеОпции = ПолучитьФункциональнуюОпцию(ИмяОпции, ПараметрыОпций);
			ЗначенияОпций.Вставить(ИмяОпции, ЗначениеОпции);
		КонецЕсли;
		Если ЗначениеОпции Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Истина;
	
КонецФункции

Процедура ВывестиЗаголовок1(ТабличныйДокумент, Текст, МакетОформления)

	ОбластьЗаголовок1 = МакетОформления.ПолучитьОбласть("Заголовок1");
	ОбластьЗаголовок1.Параметры.Заголовок1 = Текст;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок1);

КонецПроцедуры

Процедура ВывестиЗаголовок2(ТабличныйДокумент, Текст, НомерЗаголовка, МакетОформления)

	ОбластьЗаголовок2 = МакетОформления.ПолучитьОбласть("Заголовок2");
	ОбластьЗаголовок2.Параметры.Заголовок2 = ?(НомерЗаголовка > 0, Формат(НомерЗаголовка, "ЧГ=") + ". " + Текст, Текст);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок2);

КонецПроцедуры

Процедура ВывестиТекст(ТабличныйДокумент, Текст, МакетОформления)

	ОбластьТекст = МакетОформления.ПолучитьОбласть("Текст");
	ОбластьТекст.Параметры.Текст = Текст;
	ТабличныйДокумент.Вывести(ОбластьТекст);

КонецПроцедуры

Процедура ВывестиРазделитель(ТабличныйДокумент, МакетОформления)

	ОбластьРазделитель = МакетОформления.ПолучитьОбласть("Разделитель");
	ТабличныйДокумент.Вывести(ОбластьРазделитель);

КонецПроцедуры

Функция ПараметрыЗаполненияШапкиПечатнойФормы(ИмяМакета, Запись)
	
	ДатаПриказа = Запись.Период;
	ПараметрыШапки = Новый Структура;
	ПараметрыШапки.Вставить("НомерПриказа",     "___________");
	ПараметрыШапки.Вставить("ДатаПриказа",      Формат(ДатаПриказа, "ДЛФ=D"));
	ПараметрыШапки.Вставить("НомерПриложения",  "");
	ПараметрыШапки.Вставить("ЗаголовокШапки",   НСтр("ru='Печать учетной политики'"));
	ПараметрыШапки.Вставить("ЗаголовокПеречня", НСтр("ru='Перечень форм'"));
	ПараметрыШапки.Вставить("ЗаголовокФормы",   НСтр("ru='Печать учетной политики'"));
	
	Если ИмяМакета = "Приказ" Тогда
		ПараметрыШапки.ЗаголовокФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Приказ об учетной политике от %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Запись.Организация, ДатаПриказа);
		ПараметрыШапки.Вставить("ПолноеНаименованиеОрганизации",    СведенияОбОрганизации.ПолноеНаименование);
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Запись.Организация, ДатаПриказа);
		ПараметрыШапки.Вставить("ДолжностьРуководителяОрганизации", Руководители.РуководительДолжностьПредставление);
		ПараметрыШапки.Вставить("РуководительОрганизации",          Руководители.РуководительПредставление);
	ИначеЕсли ИмяМакета = "УчетнаяПолитикаБУ" Тогда
		ПараметрыШапки.НомерПриложения = 1;
		ПараметрыШапки.ЗаголовокШапки  = НСтр("ru='Учетная политика по бухгалтерскому учету'");
		ПараметрыШапки.ЗаголовокФормы  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Учетная политика БУ на %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
	ИначеЕсли ИмяМакета = "ПланСчетов" Тогда
		ПараметрыШапки.НомерПриложения = 2;
		ПараметрыШапки.ЗаголовокШапки = НСтр("ru='Рабочий план счетов'");
		ПараметрыШапки.ЗаголовокФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Рабочий план счетов на %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
	ИначеЕсли ИмяМакета = "ПервичныеДокументы" Тогда
		ПараметрыШапки.НомерПриложения  = 3;
		ПараметрыШапки.ЗаголовокШапки   = НСтр("ru='Формы первичных документов'");
		ПараметрыШапки.ЗаголовокПеречня = НСтр("ru='Перечень первичных документов'");
		ПараметрыШапки.ЗаголовокФормы   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Формы первичных документов на %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
	ИначеЕсли ИмяМакета = "РегистрыБУ" Тогда
		ПараметрыШапки.НомерПриложения  = 4;
		ПараметрыШапки.ЗаголовокШапки   = НСтр("ru='Регистры бухгалтерского учета'");
		ПараметрыШапки.ЗаголовокПеречня = НСтр("ru='Перечень регистров бухгалтерского учета'");
		ПараметрыШапки.ЗаголовокФормы   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Регистры БУ на %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
	ИначеЕсли ИмяМакета = "УчетнаяПолитикаНУ" Тогда
		ПараметрыШапки.НомерПриложения = 5;
		ПараметрыШапки.ЗаголовокШапки  = НСтр("ru='Учетная политика по налоговому учету'");
		ПараметрыШапки.ЗаголовокФормы  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Учетная политика НУ на %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
	ИначеЕсли ИмяМакета = "РегистрыНУ" Тогда
		ПараметрыШапки.НомерПриложения  = 6;
		ПараметрыШапки.ЗаголовокШапки   = НСтр("ru='Регистры налогового учета'");
		ПараметрыШапки.ЗаголовокПеречня = НСтр("ru='Перечень регистров налогового учета'");
		ПараметрыШапки.ЗаголовокФормы   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Регистры НУ на %1 по %2'"),
			Формат(Запись.Период, "ДЛФ=D"),
			Запись.Организация);
	КонецЕсли;
	
	Возврат ПараметрыШапки;
	
КонецФункции

Функция ВариантБухгалтерскойОтчетностиПоУмолчанию()
	
	Результат = Перечисления.ВариантыБухгалтерскойОтчетности.ОбщиеПравила;
	
	Если НЕ ТарификацияБПВызовСервераПовтИсп.РазрешенУчетРегулярнойДеятельности() Тогда
		Результат = Перечисления.ВариантыБухгалтерскойОтчетности.ДляМалыхПредприятий;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура Подключаемый_ПередЗаписью(Запись) Экспорт
	
	УстановитьПараметрыРезервовПоСомнительнымДолгам(Запись);
	// Проверим, что на плане счетов достаточно аналитики для выбранных настроек учетной политики
	НастройкиУчета.ВключитьРасширеннуюАналитику(НеобходимыеРазрезыАналитики(Запись));
	
КонецПроцедуры

Процедура УстановитьПараметрыРезервовПоСомнительнымДолгам(Запись)
	
	Если Не ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Запись.Организация) Тогда
		Запись.ФормироватьРезервыПоСомнительнымДолгам = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция НеобходимыеРазрезыАналитики(Запись)
	
	РазрезыАналитики = Новый Массив;
	
	Если Запись.УчитыватьРасходыПоЭлементамЗатрат Тогда
		РазрезыАналитики.Добавить("УчитыватьРасходыПоЭлементамЗатрат");
	КонецЕсли;
	
	Если Запись.УчитыватьРасходыПоСтатьямЗатрат Тогда
		РазрезыАналитики.Добавить("УчитыватьРасходыПоСтатьямЗатрат");
	КонецЕсли;
	
	Перечисления.ВариантыУчетаСтоимостиВыпуска.УстановитьРазрезАналитикиПродукция(
		РазрезыАналитики,
		Запись.СпособУчетаВыпускаГотовойПродукции);
	
	Возврат РазрезыАналитики;
	
КонецФункции

Функция РезультатЗапросаДокументыБезПлановойСебестоимости(Организация, Период, ТолькоПроверка = Ложь)
	
	// Текст ЗапросПоДокументам ниже может быть модифицирован схемой запроса.
	// В частности:
	// - может быть добавлено условие по периоду записей (если существуют более поздние записи учетной политики)
	// - если запрос выполняется для проверки, то
	//	-- выбирается максимум 1 запись
	//	-- удаляются лишние поля
	//	-- отключается упорядочивание
	ЗапросПоДокументам = Новый Запрос;
	
	ЗапросПоДокументам.УстановитьПараметр("Период",      Период);
	ЗапросПоДокументам.УстановитьПараметр("Организация", Организация);
	
	ЗапросПоДокументам.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукцииУслуг.Регистратор КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ВыпускПродукцииУслуг.Регистратор) КАК Представление,
	|	ВыпускПродукцииУслуг.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ВыпускПродукцииУслуг КАК ВыпускПродукцииУслуг
	|ГДЕ
	|	ВыпускПродукцииУслуг.Период >= &Период
	|	И ВыпускПродукцииУслуг.Организация = &Организация
	|	И НЕ ВыпускПродукцииУслуг.ПрямыеРасходыРаспределятьПоКоличеству
	|	И ВыпускПродукцииУслуг.ПлановаяСтоимость = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыпускПродукцииУслуг.Период,
	|	ВыпускПродукцииУслуг.Регистратор";
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Определим дату следующей записи
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(УчетнаяПолитика.Период) КАК Период
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК УчетнаяПолитика
	|ГДЕ
	|	УчетнаяПолитика.Период > &Период
	|	И УчетнаяПолитика.Организация = &Организация";
	
	ВыборкаСледующаяЗапись = Запрос.Выполнить().Выбрать();
	ВыборкаСледующаяЗапись.Следующий();
	
	Если НЕ ЗначениеЗаполнено(ВыборкаСледующаяЗапись.Период) И НЕ ТолькоПроверка Тогда
		// Нет более поздних записей учетной политики по выбранной организации.
		// Модификация текста запроса не требуется.
		Возврат ЗапросПоДокументам.Выполнить();
	КонецЕсли; 
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ЗапросПоДокументам.Текст);
	ЗапросВыпускПродукцииУслуг = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	
	Если ЗначениеЗаполнено(ВыборкаСледующаяЗапись.Период) Тогда
		// Ограничим выборку "сверху" датой следующей записи
		ЗапросВыпускПродукцииУслуг.Отбор.Добавить(Новый ВыражениеСхемыЗапроса("ВыпускПродукцииУслуг.Период < &ПериодСледующейЗаписи"));
		ЗапросПоДокументам.УстановитьПараметр("ПериодСледующейЗаписи", ВыборкаСледующаяЗапись.Период);
	КонецЕсли; 
	
	Если ТолькоПроверка Тогда
		
		// Оптимизируем запрос
		ЗапросВыпускПродукцииУслуг.КоличествоПолучаемыхЗаписей = 1;
		
		ЗапросВыпускПродукцииУслуг.ВыбираемыеПоля.Удалить(2);
		ЗапросВыпускПродукцииУслуг.ВыбираемыеПоля.Удалить(1);
		
		СхемаЗапроса.ПакетЗапросов[0].Порядок.Очистить();
		
	КонецЕсли; 
	
	ЗапросПоДокументам.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();	
	
	Возврат ЗапросПоДокументам.Выполнить();

КонецФункции

// Определяет значения свойств записи учетной политики, которые недоступны исходя из выбранной функциональности.
//
// Параметры:
//  Запись - РегистрСведенийЗапись.УчетнаяПолитика
// 
// Возвращаемое значение:
//  Структура - значения свойств учетной политики, которые должны быть заменены.
//              Ключ: имя ресурса (реквизита); Значение - допустимое значение (на которое нужно заменить).
//
Функция НедоступныеЗначенияСвойств(Запись)
	
	НедоступныеЗначения = Новый Структура;
	
	Если Не УчетнаяПолитика.ПоддерживаетсяУчетПоЭлементамЗатрат() Тогда
		НедоступныеЗначения.Вставить("УчитыватьРасходыПоСтатьямЗатрат",   Ложь);
		НедоступныеЗначения.Вставить("УчитыватьРасходыПоЭлементамЗатрат", Ложь);
	КонецЕсли;
	
	Если Не УчетнаяПолитика.ПоддерживаетсяСписаниеРасходовОбслуживающихПроизводств() Тогда
		НедоступныеЗначения.Вставить("РасходыОбслуживающихПроизводствВключатьВПрочиеРасходы", Ложь);
	КонецЕсли;
	
	Если Не УчетнаяПолитика.ПоддерживаетсяОценкаПродукцииПоПлановойСтоимости()
		И Запись.СпособУчетаВыпускаГотовойПродукции = Перечисления.ВариантыУчетаСтоимостиВыпуска.ПлановаяСтоимость Тогда
		НедоступныеЗначения.Вставить("СпособУчетаВыпускаГотовойПродукции", Перечисления.ВариантыУчетаСтоимостиВыпуска.ОтклоненияСтоимости);
	КонецЕсли;
	
	Возврат НедоступныеЗначения;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

Процедура УстановитьСчетУчетаЗатратПоУмолчанию() Экспорт
	
	Набор = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	ОсновнойСчетУчетаЗатрат = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;
	ПустойСчетУчетаЗатрат   = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	Для каждого Запись Из Набор Цикл
		
		Если Запись.ОсновнойСчетУчетаЗатрат = ПустойСчетУчетаЗатрат Тогда
			Запись.ОсновнойСчетУчетаЗатрат = ОсновнойСчетУчетаЗатрат;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина);
	
КонецПроцедуры

Процедура ВключитьИспользованиеБалансовогоМетодаУчетаОтложенногоНалога() Экспорт
	
	// По-умолчанию, с даты начала обязательного применения изменений, внесенных в ПБУ Приказом Минфина 236н,
	// применяется балансовый метод, а не затратный.
	// Включаем использование балансового метода только в условном будущем - т.е. только при условии,
	// что никакие периоды с начала обязательного применения не закрыты.
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		// Выполнение обработчика может приводить к появлению новой записи, поэтому обработка выполняется в главном узле,
		// а ее результаты передаются обменом.
		Возврат;
	КонецЕсли;
	
	ДатаОбязательногоПрименения = НалогНаПрибыльБухгалтерскийУчетКлиентСервер.ДатаНачалаПримененияПриказа236н();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОбязательногоПрименения", ДатаОбязательногоПрименения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаНаДатуПерехода.Период КАК Период,
	|	УчетнаяПолитикаНаДатуПерехода.Организация КАК Организация
	|ПОМЕСТИТЬ ИспользуетсяЗатратныйМетод
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&ДатаОбязательногоПрименения, ) КАК УчетнаяПолитикаНаДатуПерехода
	|ГДЕ
	|	УчетнаяПолитикаНаДатуПерехода.ВариантУчетаОтложенногоНалога = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаОтложенногоНалога.ЗатратныйМетод)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетнаяПолитикаПослеПерехода.Период,
	|	УчетнаяПолитикаПослеПерехода.Организация
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК УчетнаяПолитикаПослеПерехода
	|ГДЕ
	|	УчетнаяПолитикаПослеПерехода.ВариантУчетаОтложенногоНалога = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаОтложенногоНалога.ЗатратныйМетод)
	|	И УчетнаяПолитикаПослеПерехода.Период > &ДатаОбязательногоПрименения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегламентнаяОперация.Организация КАК Организация
	|ПОМЕСТИТЬ ЕстьРегламентныеОперации
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетНалогаНаПрибыль)
	|	И РегламентнаяОперация.Организация В
	|			(ВЫБРАТЬ
	|				ИспользуетсяЗатратныйМетод.Организация
	|			ИЗ
	|				ИспользуетсяЗатратныйМетод)
	|	И РегламентнаяОперация.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Выполнено)
	|	И РегламентнаяОперация.Дата >= &ДатаОбязательногоПрименения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуетсяЗатратныйМетод.Период КАК Период,
	|	ИспользуетсяЗатратныйМетод.Организация КАК Организация
	|ИЗ
	|	ИспользуетсяЗатратныйМетод КАК ИспользуетсяЗатратныйМетод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьРегламентныеОперации КАК ЕстьРегламентныеОперации
	|		ПО ИспользуетсяЗатратныйМетод.Организация = ЕстьРегламентныеОперации.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ИспользуетсяЗатратныйМетод.Организация = Организации.Ссылка
	|ГДЕ
	|	ЕстьРегламентныеОперации.Организация ЕСТЬ NULL
	|	И Организации.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Прочитать();
		
		Если Выборка.Период < ДатаОбязательногоПрименения Тогда
			// Балансовый метод должен быть включен с даты начала обязательного применения.
			// Записи выбираются с даты обязательного применения.
			// То, что при этом выбрана более ранняя запись, означает, что записи на дату обязательного применения нет.
			// Поэтому скопируем предыдущую запись (такая ровно одна на организацию, так как получена из среза последних).
			НаборЗаписей.Отбор.Период.Установить(ДатаОбязательногоПрименения);
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.Период = ДатаОбязательногоПрименения;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ВариантУчетаОтложенногоНалога = Перечисления.ВариантыУчетаОтложенногоНалога.БалансовыйМетодПостоянныеРазницы;
		КонецЦикла;
		
		Замещать             = Истина; // Может обновляться существующая запись
		ПередаватьОбменом    = Истина; // Выполнение обработчика может приводить к появлению новых записей
		ВключитьБизнесЛогику = Истина; // Следует выполнить логику, заполняющую значения полей, недоступных с определенного периода
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Замещать, ПередаватьОбменом, ВключитьБизнесЛогику);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВключитьИспользованиеПлановойСебестоимости() Экспорт
	
	Набор = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	Набор.Прочитать();
		
	Для каждого Запись Из Набор Цикл
		Запись.ИспользоватьПлановуюСебестоимость = (Запись.ВыпускПродукции ИЛИ Запись.ОказаниеУслуг);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина);
	
КонецПроцедуры

Процедура УстановитьСпособОтраженияАвансовыВыданных() Экспорт
	Набор = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	СпособОтраженияПоУмолчанию = Перечисления.СпособОтраженияАвансовВыданных.ДебиторскаяЗадолженность;
	
	Для каждого Запись Из Набор Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.СпособОтраженияАвансовВыданных) Тогда
			Запись.СпособОтраженияАвансовВыданных = СпособОтраженияПоУмолчанию;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина);
КонецПроцедуры

Процедура СоздатьЗаписи2021() Экспорт
	
	// С 2021 года действует ФСБУ 5, который меняет настройки учетной политики.
	// Для определенности добавим отдельную запись - так, чтобы "до ФСБУ 5" и "после ФСБУ 5" было разными записями.
	
	ПериодПерехода = БухгалтерскийУчетКлиентСервер.ДатаОбязательногоПримененияФСБУ5();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодПерехода", ПериодПерехода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаСрезПоследних.Период КАК Период,
	|	УчетнаяПолитикаСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&ПериодПерехода, ) КАК УчетнаяПолитикаСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаСрезПоследних.Период < &ПериодПерехода";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			СкопироватьЗапись(Выборка, ПериодПерехода);
			
		Исключение
			
			// Обработчик обновления - сервисный.
			// Если он не будет выполнен, то продолжать работу можно.
			
			// Обработка возможных нарушений стандарта разработки
			// в вызываемом коде библиотек
			Пока ТранзакцияАктивна() Цикл
				ОтменитьТранзакцию();
			КонецЦикла;
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ОбработкаОбновления'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.УчетнаяПолитика,
				,
				ОписаниеОшибки());
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
